//Комопнент нижнего колонтитула страницы
export function Footer() {
    //Возврат компонента
    return (
        <div className='footer__block'>
            <div className='footer__block-inner'>
                <span>Сомневаетесь? Не можете выбрать подходящего персонажа или хотите создать своего? Обратитесь к Создателю.</span>
                <div className='footer__block-actions'>
                    <a className='base__button'>Задать вопрос</a>
                    <a className='base__button'>Начать путешествие</a>
                </div>
            </div>
            <div className='footer__block-contacts'>
                <a>
                    <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <g clip-path="url(#clip0_43_3724)">
                            <path d="M32.0047 16C32.0047 20.2435 30.319 24.3131 27.3184 27.3137C24.3178 30.3143 20.2482 32 16.0047 32C11.7612 32 7.69157 30.3143 4.69099 27.3137C1.69041 24.3131 0.00469971 20.2435 0.00469971 16C0.00469971 11.7565 1.69041 7.68687 4.69099 4.68629C7.69157 1.68571 11.7612 0 16.0047 0C20.2482 0 24.3178 1.68571 27.3184 4.68629C30.319 7.68687 32.0047 11.7565 32.0047 16ZM16.5787 11.812C15.0214 12.46 11.9107 13.8 7.2467 15.832C6.4907 16.132 6.09403 16.4267 6.0567 16.716C5.9967 17.202 6.6067 17.394 7.4367 17.656L7.7867 17.766C8.6027 18.032 9.7027 18.342 10.2727 18.354C10.7927 18.3673 11.3714 18.154 12.0087 17.714C16.3674 14.7727 18.6167 13.286 18.7567 13.254C18.8567 13.23 18.9967 13.202 19.0887 13.286C19.1807 13.37 19.1727 13.526 19.1627 13.568C19.1027 13.826 16.7087 16.05 15.4707 17.202C15.0847 17.562 14.8107 17.816 14.7547 17.874C14.6314 18.0001 14.5061 18.1241 14.3787 18.246C13.6187 18.978 13.0507 19.526 14.4087 20.422C15.0627 20.854 15.5867 21.208 16.1087 21.564C16.6767 21.952 17.2447 22.338 17.9807 22.822C18.1674 22.9447 18.3474 23.0693 18.5207 23.196C19.1827 23.668 19.7807 24.092 20.5147 24.024C20.9427 23.984 21.3847 23.584 21.6087 22.384C22.1387 19.55 23.1807 13.412 23.4207 10.882C23.4358 10.6717 23.4271 10.4604 23.3947 10.252C23.3753 10.084 23.294 9.92929 23.1667 9.818C22.9845 9.69287 22.7677 9.62784 22.5467 9.632C21.9467 9.642 21.0207 9.964 16.5787 11.812Z" fill="white" />
                        </g>
                        <defs>
                            <clipPath id="clip0_43_3724">
                                <rect width="32" height="32" fill="white" transform="translate(0.00469971)" />
                            </clipPath>
                        </defs>
                    </svg>
                </a>
            </div>
            <div className='footer__block-logo'>
                <img src='favicon.ico' alt='' className='menu__image-logo' />
                <span>INSANIA</span>
                <span>2025</span>
            </div>
        </div>
    );
}